name: "ResNet-20"

layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  image_data_param {
    source: "../lists/roi-train.lst"
    batch_size: 8
    shuffle: true
    new_width:256
    new_height:256
  }
}

layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  image_data_param {
    source: "../lists/roi-val.lst"
    batch_size: 8
    shuffle: true
    new_width:256
    new_height:256
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv1_bn"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1_bn"
  top: "conv1_bn"
}layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_bn"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}layer {
  name: "conv1_output"
  type: "Convolution"
  bottom: "pool1"
  top: "conv1_output"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv2_1_1"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_1_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv2_1_1_bn"
  type: "BatchNorm"
  bottom: "conv2_1_1"
  top: "conv2_1_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv2_1_1_relu"
  type: "ReLU"
  bottom: "conv2_1_1_bn"
  top: "conv2_1_1_bn"
}layer {
  name: "conv2_1_2"
  type: "Convolution"
  bottom: "conv2_1_1_bn"
  top: "conv2_1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv2_1_2_bn"
  type: "BatchNorm"
  bottom: "conv2_1_2"
  top: "conv2_1_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv2_1_2_relu"
  type: "ReLU"
  bottom: "conv2_1_2_bn"
  top: "conv2_1_2_bn"
}layer {
  name: "conv2_1_3"
  type: "Convolution"
  bottom: "conv2_1_2_bn"
  top: "conv2_1_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv2_1_sum"
  type: "Eltwise"
  bottom: "conv1_output"
  bottom: "conv2_1_3"
  top: "conv2_1_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv2_1_sum_bn"
  type: "BatchNorm"
  bottom: "conv2_1_sum"
  top: "conv2_1_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv2_1_sum_relu"
  type: "ReLU"
  bottom: "conv2_1_sum_bn"
  top: "conv2_1_sum_bn"
}layer {
  name: "conv2_2_1"
  type: "Convolution"
  bottom: "conv2_1_sum_bn"
  top: "conv2_2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv2_2_1_bn"
  type: "BatchNorm"
  bottom: "conv2_2_1"
  top: "conv2_2_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv2_2_1_relu"
  type: "ReLU"
  bottom: "conv2_2_1_bn"
  top: "conv2_2_1_bn"
}layer {
  name: "conv2_2_2"
  type: "Convolution"
  bottom: "conv2_2_1_bn"
  top: "conv2_2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv2_2_2_bn"
  type: "BatchNorm"
  bottom: "conv2_2_2"
  top: "conv2_2_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv2_2_2_relu"
  type: "ReLU"
  bottom: "conv2_2_2_bn"
  top: "conv2_2_2_bn"
}layer {
  name: "conv2_2_3"
  type: "Convolution"
  bottom: "conv2_2_2_bn"
  top: "conv2_2_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv2_2_sum"
  type: "Eltwise"
  bottom: "conv2_1_sum_bn"
  bottom: "conv2_2_3"
  top: "conv2_2_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv2_2_sum_bn"
  type: "BatchNorm"
  bottom: "conv2_2_sum"
  top: "conv2_2_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv2_2_sum_relu"
  type: "ReLU"
  bottom: "conv2_2_sum_bn"
  top: "conv2_2_sum_bn"
}layer {
  name: "conv2_3_1"
  type: "Convolution"
  bottom: "conv2_2_sum_bn"
  top: "conv2_3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv2_3_1_bn"
  type: "BatchNorm"
  bottom: "conv2_3_1"
  top: "conv2_3_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv2_3_1_relu"
  type: "ReLU"
  bottom: "conv2_3_1_bn"
  top: "conv2_3_1_bn"
}layer {
  name: "conv2_3_2"
  type: "Convolution"
  bottom: "conv2_3_1_bn"
  top: "conv2_3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv2_3_2_bn"
  type: "BatchNorm"
  bottom: "conv2_3_2"
  top: "conv2_3_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv2_3_2_relu"
  type: "ReLU"
  bottom: "conv2_3_2_bn"
  top: "conv2_3_2_bn"
}layer {
  name: "conv2_3_3"
  type: "Convolution"
  bottom: "conv2_3_2_bn"
  top: "conv2_3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv2_3_sum"
  type: "Eltwise"
  bottom: "conv2_2_sum_bn"
  bottom: "conv2_3_3"
  top: "conv2_3_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv2_3_sum_bn"
  type: "BatchNorm"
  bottom: "conv2_3_sum"
  top: "conv2_3_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv2_3_sum_relu"
  type: "ReLU"
  bottom: "conv2_3_sum_bn"
  top: "conv2_3_sum_bn"
}layer {
  name: "conv2_output"
  type: "Convolution"
  bottom: "conv2_3_sum_bn"
  top: "conv2_output"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_1_1"
  type: "Convolution"
  bottom: "conv2_3_sum_bn"
  top: "conv3_1_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_1_1_bn"
  type: "BatchNorm"
  bottom: "conv3_1_1"
  top: "conv3_1_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_1_1_relu"
  type: "ReLU"
  bottom: "conv3_1_1_bn"
  top: "conv3_1_1_bn"
}layer {
  name: "conv3_1_2"
  type: "Convolution"
  bottom: "conv3_1_1_bn"
  top: "conv3_1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_1_2_bn"
  type: "BatchNorm"
  bottom: "conv3_1_2"
  top: "conv3_1_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_1_2_relu"
  type: "ReLU"
  bottom: "conv3_1_2_bn"
  top: "conv3_1_2_bn"
}layer {
  name: "conv3_1_3"
  type: "Convolution"
  bottom: "conv3_1_2_bn"
  top: "conv3_1_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_1_sum"
  type: "Eltwise"
  bottom: "conv2_output"
  bottom: "conv3_1_3"
  top: "conv3_1_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv3_1_sum_bn"
  type: "BatchNorm"
  bottom: "conv3_1_sum"
  top: "conv3_1_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_1_sum_relu"
  type: "ReLU"
  bottom: "conv3_1_sum_bn"
  top: "conv3_1_sum_bn"
}layer {
  name: "conv3_2_1"
  type: "Convolution"
  bottom: "conv3_1_sum_bn"
  top: "conv3_2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_2_1_bn"
  type: "BatchNorm"
  bottom: "conv3_2_1"
  top: "conv3_2_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_2_1_relu"
  type: "ReLU"
  bottom: "conv3_2_1_bn"
  top: "conv3_2_1_bn"
}layer {
  name: "conv3_2_2"
  type: "Convolution"
  bottom: "conv3_2_1_bn"
  top: "conv3_2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_2_2_bn"
  type: "BatchNorm"
  bottom: "conv3_2_2"
  top: "conv3_2_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_2_2_relu"
  type: "ReLU"
  bottom: "conv3_2_2_bn"
  top: "conv3_2_2_bn"
}layer {
  name: "conv3_2_3"
  type: "Convolution"
  bottom: "conv3_2_2_bn"
  top: "conv3_2_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_2_sum"
  type: "Eltwise"
  bottom: "conv3_1_sum_bn"
  bottom: "conv3_2_3"
  top: "conv3_2_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv3_2_sum_bn"
  type: "BatchNorm"
  bottom: "conv3_2_sum"
  top: "conv3_2_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_2_sum_relu"
  type: "ReLU"
  bottom: "conv3_2_sum_bn"
  top: "conv3_2_sum_bn"
}layer {
  name: "conv3_3_1"
  type: "Convolution"
  bottom: "conv3_2_sum_bn"
  top: "conv3_3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_3_1_bn"
  type: "BatchNorm"
  bottom: "conv3_3_1"
  top: "conv3_3_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_3_1_relu"
  type: "ReLU"
  bottom: "conv3_3_1_bn"
  top: "conv3_3_1_bn"
}layer {
  name: "conv3_3_2"
  type: "Convolution"
  bottom: "conv3_3_1_bn"
  top: "conv3_3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_3_2_bn"
  type: "BatchNorm"
  bottom: "conv3_3_2"
  top: "conv3_3_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_3_2_relu"
  type: "ReLU"
  bottom: "conv3_3_2_bn"
  top: "conv3_3_2_bn"
}layer {
  name: "conv3_3_3"
  type: "Convolution"
  bottom: "conv3_3_2_bn"
  top: "conv3_3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_3_sum"
  type: "Eltwise"
  bottom: "conv3_2_sum_bn"
  bottom: "conv3_3_3"
  top: "conv3_3_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv3_3_sum_bn"
  type: "BatchNorm"
  bottom: "conv3_3_sum"
  top: "conv3_3_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_3_sum_relu"
  type: "ReLU"
  bottom: "conv3_3_sum_bn"
  top: "conv3_3_sum_bn"
}layer {
  name: "conv3_4_1"
  type: "Convolution"
  bottom: "conv3_3_sum_bn"
  top: "conv3_4_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_4_1_bn"
  type: "BatchNorm"
  bottom: "conv3_4_1"
  top: "conv3_4_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_4_1_relu"
  type: "ReLU"
  bottom: "conv3_4_1_bn"
  top: "conv3_4_1_bn"
}layer {
  name: "conv3_4_2"
  type: "Convolution"
  bottom: "conv3_4_1_bn"
  top: "conv3_4_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_4_2_bn"
  type: "BatchNorm"
  bottom: "conv3_4_2"
  top: "conv3_4_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_4_2_relu"
  type: "ReLU"
  bottom: "conv3_4_2_bn"
  top: "conv3_4_2_bn"
}layer {
  name: "conv3_4_3"
  type: "Convolution"
  bottom: "conv3_4_2_bn"
  top: "conv3_4_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_4_sum"
  type: "Eltwise"
  bottom: "conv3_3_sum_bn"
  bottom: "conv3_4_3"
  top: "conv3_4_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv3_4_sum_bn"
  type: "BatchNorm"
  bottom: "conv3_4_sum"
  top: "conv3_4_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_4_sum_relu"
  type: "ReLU"
  bottom: "conv3_4_sum_bn"
  top: "conv3_4_sum_bn"
}layer {
  name: "conv3_5_1"
  type: "Convolution"
  bottom: "conv3_4_sum_bn"
  top: "conv3_5_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_5_1_bn"
  type: "BatchNorm"
  bottom: "conv3_5_1"
  top: "conv3_5_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_5_1_relu"
  type: "ReLU"
  bottom: "conv3_5_1_bn"
  top: "conv3_5_1_bn"
}layer {
  name: "conv3_5_2"
  type: "Convolution"
  bottom: "conv3_5_1_bn"
  top: "conv3_5_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_5_2_bn"
  type: "BatchNorm"
  bottom: "conv3_5_2"
  top: "conv3_5_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_5_2_relu"
  type: "ReLU"
  bottom: "conv3_5_2_bn"
  top: "conv3_5_2_bn"
}layer {
  name: "conv3_5_3"
  type: "Convolution"
  bottom: "conv3_5_2_bn"
  top: "conv3_5_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_5_sum"
  type: "Eltwise"
  bottom: "conv3_4_sum_bn"
  bottom: "conv3_5_3"
  top: "conv3_5_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv3_5_sum_bn"
  type: "BatchNorm"
  bottom: "conv3_5_sum"
  top: "conv3_5_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_5_sum_relu"
  type: "ReLU"
  bottom: "conv3_5_sum_bn"
  top: "conv3_5_sum_bn"
}layer {
  name: "conv3_6_1"
  type: "Convolution"
  bottom: "conv3_5_sum_bn"
  top: "conv3_6_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_6_1_bn"
  type: "BatchNorm"
  bottom: "conv3_6_1"
  top: "conv3_6_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_6_1_relu"
  type: "ReLU"
  bottom: "conv3_6_1_bn"
  top: "conv3_6_1_bn"
}layer {
  name: "conv3_6_2"
  type: "Convolution"
  bottom: "conv3_6_1_bn"
  top: "conv3_6_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_6_2_bn"
  type: "BatchNorm"
  bottom: "conv3_6_2"
  top: "conv3_6_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_6_2_relu"
  type: "ReLU"
  bottom: "conv3_6_2_bn"
  top: "conv3_6_2_bn"
}layer {
  name: "conv3_6_3"
  type: "Convolution"
  bottom: "conv3_6_2_bn"
  top: "conv3_6_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_6_sum"
  type: "Eltwise"
  bottom: "conv3_5_sum_bn"
  bottom: "conv3_6_3"
  top: "conv3_6_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv3_6_sum_bn"
  type: "BatchNorm"
  bottom: "conv3_6_sum"
  top: "conv3_6_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_6_sum_relu"
  type: "ReLU"
  bottom: "conv3_6_sum_bn"
  top: "conv3_6_sum_bn"
}layer {
  name: "conv3_7_1"
  type: "Convolution"
  bottom: "conv3_6_sum_bn"
  top: "conv3_7_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_7_1_bn"
  type: "BatchNorm"
  bottom: "conv3_7_1"
  top: "conv3_7_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_7_1_relu"
  type: "ReLU"
  bottom: "conv3_7_1_bn"
  top: "conv3_7_1_bn"
}layer {
  name: "conv3_7_2"
  type: "Convolution"
  bottom: "conv3_7_1_bn"
  top: "conv3_7_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_7_2_bn"
  type: "BatchNorm"
  bottom: "conv3_7_2"
  top: "conv3_7_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_7_2_relu"
  type: "ReLU"
  bottom: "conv3_7_2_bn"
  top: "conv3_7_2_bn"
}layer {
  name: "conv3_7_3"
  type: "Convolution"
  bottom: "conv3_7_2_bn"
  top: "conv3_7_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_7_sum"
  type: "Eltwise"
  bottom: "conv3_6_sum_bn"
  bottom: "conv3_7_3"
  top: "conv3_7_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv3_7_sum_bn"
  type: "BatchNorm"
  bottom: "conv3_7_sum"
  top: "conv3_7_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_7_sum_relu"
  type: "ReLU"
  bottom: "conv3_7_sum_bn"
  top: "conv3_7_sum_bn"
}layer {
  name: "conv3_8_1"
  type: "Convolution"
  bottom: "conv3_7_sum_bn"
  top: "conv3_8_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_8_1_bn"
  type: "BatchNorm"
  bottom: "conv3_8_1"
  top: "conv3_8_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_8_1_relu"
  type: "ReLU"
  bottom: "conv3_8_1_bn"
  top: "conv3_8_1_bn"
}layer {
  name: "conv3_8_2"
  type: "Convolution"
  bottom: "conv3_8_1_bn"
  top: "conv3_8_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_8_2_bn"
  type: "BatchNorm"
  bottom: "conv3_8_2"
  top: "conv3_8_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_8_2_relu"
  type: "ReLU"
  bottom: "conv3_8_2_bn"
  top: "conv3_8_2_bn"
}layer {
  name: "conv3_8_3"
  type: "Convolution"
  bottom: "conv3_8_2_bn"
  top: "conv3_8_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv3_8_sum"
  type: "Eltwise"
  bottom: "conv3_7_sum_bn"
  bottom: "conv3_8_3"
  top: "conv3_8_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv3_8_sum_bn"
  type: "BatchNorm"
  bottom: "conv3_8_sum"
  top: "conv3_8_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv3_8_sum_relu"
  type: "ReLU"
  bottom: "conv3_8_sum_bn"
  top: "conv3_8_sum_bn"
}layer {
  name: "conv3_output"
  type: "Convolution"
  bottom: "conv3_8_sum_bn"
  top: "conv3_output"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_1_1"
  type: "Convolution"
  bottom: "conv3_8_sum_bn"
  top: "conv4_1_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_1_1_bn"
  type: "BatchNorm"
  bottom: "conv4_1_1"
  top: "conv4_1_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_1_1_relu"
  type: "ReLU"
  bottom: "conv4_1_1_bn"
  top: "conv4_1_1_bn"
}layer {
  name: "conv4_1_2"
  type: "Convolution"
  bottom: "conv4_1_1_bn"
  top: "conv4_1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_1_2_bn"
  type: "BatchNorm"
  bottom: "conv4_1_2"
  top: "conv4_1_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_1_2_relu"
  type: "ReLU"
  bottom: "conv4_1_2_bn"
  top: "conv4_1_2_bn"
}layer {
  name: "conv4_1_3"
  type: "Convolution"
  bottom: "conv4_1_2_bn"
  top: "conv4_1_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_1_sum"
  type: "Eltwise"
  bottom: "conv3_output"
  bottom: "conv4_1_3"
  top: "conv4_1_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv4_1_sum_bn"
  type: "BatchNorm"
  bottom: "conv4_1_sum"
  top: "conv4_1_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_1_sum_relu"
  type: "ReLU"
  bottom: "conv4_1_sum_bn"
  top: "conv4_1_sum_bn"
}layer {
  name: "conv4_2_1"
  type: "Convolution"
  bottom: "conv4_1_sum_bn"
  top: "conv4_2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_2_1_bn"
  type: "BatchNorm"
  bottom: "conv4_2_1"
  top: "conv4_2_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_2_1_relu"
  type: "ReLU"
  bottom: "conv4_2_1_bn"
  top: "conv4_2_1_bn"
}layer {
  name: "conv4_2_2"
  type: "Convolution"
  bottom: "conv4_2_1_bn"
  top: "conv4_2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_2_2_bn"
  type: "BatchNorm"
  bottom: "conv4_2_2"
  top: "conv4_2_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_2_2_relu"
  type: "ReLU"
  bottom: "conv4_2_2_bn"
  top: "conv4_2_2_bn"
}layer {
  name: "conv4_2_3"
  type: "Convolution"
  bottom: "conv4_2_2_bn"
  top: "conv4_2_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_2_sum"
  type: "Eltwise"
  bottom: "conv4_1_sum_bn"
  bottom: "conv4_2_3"
  top: "conv4_2_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv4_2_sum_bn"
  type: "BatchNorm"
  bottom: "conv4_2_sum"
  top: "conv4_2_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_2_sum_relu"
  type: "ReLU"
  bottom: "conv4_2_sum_bn"
  top: "conv4_2_sum_bn"
}layer {
  name: "conv4_3_1"
  type: "Convolution"
  bottom: "conv4_2_sum_bn"
  top: "conv4_3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_3_1_bn"
  type: "BatchNorm"
  bottom: "conv4_3_1"
  top: "conv4_3_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_3_1_relu"
  type: "ReLU"
  bottom: "conv4_3_1_bn"
  top: "conv4_3_1_bn"
}layer {
  name: "conv4_3_2"
  type: "Convolution"
  bottom: "conv4_3_1_bn"
  top: "conv4_3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_3_2_bn"
  type: "BatchNorm"
  bottom: "conv4_3_2"
  top: "conv4_3_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_3_2_relu"
  type: "ReLU"
  bottom: "conv4_3_2_bn"
  top: "conv4_3_2_bn"
}layer {
  name: "conv4_3_3"
  type: "Convolution"
  bottom: "conv4_3_2_bn"
  top: "conv4_3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_3_sum"
  type: "Eltwise"
  bottom: "conv4_2_sum_bn"
  bottom: "conv4_3_3"
  top: "conv4_3_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv4_3_sum_bn"
  type: "BatchNorm"
  bottom: "conv4_3_sum"
  top: "conv4_3_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_3_sum_relu"
  type: "ReLU"
  bottom: "conv4_3_sum_bn"
  top: "conv4_3_sum_bn"
}layer {
  name: "conv4_4_1"
  type: "Convolution"
  bottom: "conv4_3_sum_bn"
  top: "conv4_4_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_4_1_bn"
  type: "BatchNorm"
  bottom: "conv4_4_1"
  top: "conv4_4_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_4_1_relu"
  type: "ReLU"
  bottom: "conv4_4_1_bn"
  top: "conv4_4_1_bn"
}layer {
  name: "conv4_4_2"
  type: "Convolution"
  bottom: "conv4_4_1_bn"
  top: "conv4_4_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_4_2_bn"
  type: "BatchNorm"
  bottom: "conv4_4_2"
  top: "conv4_4_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_4_2_relu"
  type: "ReLU"
  bottom: "conv4_4_2_bn"
  top: "conv4_4_2_bn"
}layer {
  name: "conv4_4_3"
  type: "Convolution"
  bottom: "conv4_4_2_bn"
  top: "conv4_4_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_4_sum"
  type: "Eltwise"
  bottom: "conv4_3_sum_bn"
  bottom: "conv4_4_3"
  top: "conv4_4_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv4_4_sum_bn"
  type: "BatchNorm"
  bottom: "conv4_4_sum"
  top: "conv4_4_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_4_sum_relu"
  type: "ReLU"
  bottom: "conv4_4_sum_bn"
  top: "conv4_4_sum_bn"
}layer {
  name: "conv4_5_1"
  type: "Convolution"
  bottom: "conv4_4_sum_bn"
  top: "conv4_5_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_5_1_bn"
  type: "BatchNorm"
  bottom: "conv4_5_1"
  top: "conv4_5_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_5_1_relu"
  type: "ReLU"
  bottom: "conv4_5_1_bn"
  top: "conv4_5_1_bn"
}layer {
  name: "conv4_5_2"
  type: "Convolution"
  bottom: "conv4_5_1_bn"
  top: "conv4_5_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_5_2_bn"
  type: "BatchNorm"
  bottom: "conv4_5_2"
  top: "conv4_5_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_5_2_relu"
  type: "ReLU"
  bottom: "conv4_5_2_bn"
  top: "conv4_5_2_bn"
}layer {
  name: "conv4_5_3"
  type: "Convolution"
  bottom: "conv4_5_2_bn"
  top: "conv4_5_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_5_sum"
  type: "Eltwise"
  bottom: "conv4_4_sum_bn"
  bottom: "conv4_5_3"
  top: "conv4_5_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv4_5_sum_bn"
  type: "BatchNorm"
  bottom: "conv4_5_sum"
  top: "conv4_5_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_5_sum_relu"
  type: "ReLU"
  bottom: "conv4_5_sum_bn"
  top: "conv4_5_sum_bn"
}layer {
  name: "conv4_6_1"
  type: "Convolution"
  bottom: "conv4_5_sum_bn"
  top: "conv4_6_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_6_1_bn"
  type: "BatchNorm"
  bottom: "conv4_6_1"
  top: "conv4_6_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_6_1_relu"
  type: "ReLU"
  bottom: "conv4_6_1_bn"
  top: "conv4_6_1_bn"
}layer {
  name: "conv4_6_2"
  type: "Convolution"
  bottom: "conv4_6_1_bn"
  top: "conv4_6_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_6_2_bn"
  type: "BatchNorm"
  bottom: "conv4_6_2"
  top: "conv4_6_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_6_2_relu"
  type: "ReLU"
  bottom: "conv4_6_2_bn"
  top: "conv4_6_2_bn"
}layer {
  name: "conv4_6_3"
  type: "Convolution"
  bottom: "conv4_6_2_bn"
  top: "conv4_6_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_6_sum"
  type: "Eltwise"
  bottom: "conv4_5_sum_bn"
  bottom: "conv4_6_3"
  top: "conv4_6_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv4_6_sum_bn"
  type: "BatchNorm"
  bottom: "conv4_6_sum"
  top: "conv4_6_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_6_sum_relu"
  type: "ReLU"
  bottom: "conv4_6_sum_bn"
  top: "conv4_6_sum_bn"
}layer {
  name: "conv4_7_1"
  type: "Convolution"
  bottom: "conv4_6_sum_bn"
  top: "conv4_7_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_7_1_bn"
  type: "BatchNorm"
  bottom: "conv4_7_1"
  top: "conv4_7_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_7_1_relu"
  type: "ReLU"
  bottom: "conv4_7_1_bn"
  top: "conv4_7_1_bn"
}layer {
  name: "conv4_7_2"
  type: "Convolution"
  bottom: "conv4_7_1_bn"
  top: "conv4_7_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_7_2_bn"
  type: "BatchNorm"
  bottom: "conv4_7_2"
  top: "conv4_7_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_7_2_relu"
  type: "ReLU"
  bottom: "conv4_7_2_bn"
  top: "conv4_7_2_bn"
}layer {
  name: "conv4_7_3"
  type: "Convolution"
  bottom: "conv4_7_2_bn"
  top: "conv4_7_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_7_sum"
  type: "Eltwise"
  bottom: "conv4_6_sum_bn"
  bottom: "conv4_7_3"
  top: "conv4_7_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv4_7_sum_bn"
  type: "BatchNorm"
  bottom: "conv4_7_sum"
  top: "conv4_7_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_7_sum_relu"
  type: "ReLU"
  bottom: "conv4_7_sum_bn"
  top: "conv4_7_sum_bn"
}layer {
  name: "conv4_8_1"
  type: "Convolution"
  bottom: "conv4_7_sum_bn"
  top: "conv4_8_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_8_1_bn"
  type: "BatchNorm"
  bottom: "conv4_8_1"
  top: "conv4_8_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_8_1_relu"
  type: "ReLU"
  bottom: "conv4_8_1_bn"
  top: "conv4_8_1_bn"
}layer {
  name: "conv4_8_2"
  type: "Convolution"
  bottom: "conv4_8_1_bn"
  top: "conv4_8_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_8_2_bn"
  type: "BatchNorm"
  bottom: "conv4_8_2"
  top: "conv4_8_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_8_2_relu"
  type: "ReLU"
  bottom: "conv4_8_2_bn"
  top: "conv4_8_2_bn"
}layer {
  name: "conv4_8_3"
  type: "Convolution"
  bottom: "conv4_8_2_bn"
  top: "conv4_8_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_8_sum"
  type: "Eltwise"
  bottom: "conv4_7_sum_bn"
  bottom: "conv4_8_3"
  top: "conv4_8_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv4_8_sum_bn"
  type: "BatchNorm"
  bottom: "conv4_8_sum"
  top: "conv4_8_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_8_sum_relu"
  type: "ReLU"
  bottom: "conv4_8_sum_bn"
  top: "conv4_8_sum_bn"
}layer {
  name: "conv4_9_1"
  type: "Convolution"
  bottom: "conv4_8_sum_bn"
  top: "conv4_9_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_9_1_bn"
  type: "BatchNorm"
  bottom: "conv4_9_1"
  top: "conv4_9_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_9_1_relu"
  type: "ReLU"
  bottom: "conv4_9_1_bn"
  top: "conv4_9_1_bn"
}layer {
  name: "conv4_9_2"
  type: "Convolution"
  bottom: "conv4_9_1_bn"
  top: "conv4_9_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_9_2_bn"
  type: "BatchNorm"
  bottom: "conv4_9_2"
  top: "conv4_9_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_9_2_relu"
  type: "ReLU"
  bottom: "conv4_9_2_bn"
  top: "conv4_9_2_bn"
}layer {
  name: "conv4_9_3"
  type: "Convolution"
  bottom: "conv4_9_2_bn"
  top: "conv4_9_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_9_sum"
  type: "Eltwise"
  bottom: "conv4_8_sum_bn"
  bottom: "conv4_9_3"
  top: "conv4_9_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv4_9_sum_bn"
  type: "BatchNorm"
  bottom: "conv4_9_sum"
  top: "conv4_9_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_9_sum_relu"
  type: "ReLU"
  bottom: "conv4_9_sum_bn"
  top: "conv4_9_sum_bn"
}layer {
  name: "conv4_10_1"
  type: "Convolution"
  bottom: "conv4_9_sum_bn"
  top: "conv4_10_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_10_1_bn"
  type: "BatchNorm"
  bottom: "conv4_10_1"
  top: "conv4_10_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_10_1_relu"
  type: "ReLU"
  bottom: "conv4_10_1_bn"
  top: "conv4_10_1_bn"
}layer {
  name: "conv4_10_2"
  type: "Convolution"
  bottom: "conv4_10_1_bn"
  top: "conv4_10_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_10_2_bn"
  type: "BatchNorm"
  bottom: "conv4_10_2"
  top: "conv4_10_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_10_2_relu"
  type: "ReLU"
  bottom: "conv4_10_2_bn"
  top: "conv4_10_2_bn"
}layer {
  name: "conv4_10_3"
  type: "Convolution"
  bottom: "conv4_10_2_bn"
  top: "conv4_10_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_10_sum"
  type: "Eltwise"
  bottom: "conv4_9_sum_bn"
  bottom: "conv4_10_3"
  top: "conv4_10_sum"
  eltwise_param {
    operation: SUM
  }
}layer {
  name: "conv4_10_sum_bn"
  type: "BatchNorm"
  bottom: "conv4_10_sum"
  top: "conv4_10_sum_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_10_sum_relu"
  type: "ReLU"
  bottom: "conv4_10_sum_bn"
  top: "conv4_10_sum_bn"
}layer {
  name: "conv4_11_1"
  type: "Convolution"
  bottom: "conv4_10_sum_bn"
  top: "conv4_11_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_11_1_bn"
  type: "BatchNorm"
  bottom: "conv4_11_1"
  top: "conv4_11_1_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_11_1_relu"
  type: "ReLU"
  bottom: "conv4_11_1_bn"
  top: "conv4_11_1_bn"
}layer {
  name: "conv4_11_2"
  type: "Convolution"
  bottom: "conv4_11_1_bn"
  top: "conv4_11_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}layer {
  name: "conv4_11_2_bn"
  type: "BatchNorm"
  bottom: "conv4_11_2"
  top: "conv4_11_2_bn"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}layer {
  name: "conv4_11_2_relu"
  type: "ReLU"
  bottom: "conv4_11_2_bn"
  top: "conv4_11_2_bn"
}layer {
  name: "conv4_11_3"
  type: "Convolution"
  bottom: "conv4_11_2_bn"
  top: "conv4_11_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 0
